Revit 2027 API
LightFamily.GetLightFamily Method
 Creates a light family object from the given family document
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LightFamily GetLightFamily(
	Document document
)
Public Shared Function GetLightFamily (
	document As Document
) As LightFamily
public:
static LightFamily^ GetLightFamily(
	Document^ document
)
static member GetLightFamily :
        document : Document -> LightFamily
Parameters
document Document
 The family document
Return Value
LightFamily
 The newly created LightFamily object
Exceptions
Exception | Condition
ArgumentException |  The Document is the argument that is being validated The document is not valid because it is not a light family document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace